{
  "Pendidikan Pancasila": [
  {
    "type": "text",
    "text": "Apa yang dimaksud dengan Pancasila sebagai dasar negara?",
    "options": [
      "a. Dasar untuk merancang undang-undang",
      "b. Prinsip hidup individu atau perorangan",
      "c. Ideologi yang digunakan dalam pemerintahan",
      "d. Pandangan hidup bangsa yang harus diterapkan dalam kehidupan sehari-hari"
    ],
    "answer": "d"
  },
  {
    "type": "text",
    "text": "contoh pengamalan Sila Kemanusiaan yang Adil dan Beradab adalah...",
    "options": [
      "a. Mengabaikan hak orang lain",
      "b. Menghormati martabat setiap individu",
      "c. Mengutamakan kepentingan pribadi",
      "d. Hanya kelompok tertentu yang terlibat dalam keputusan"
    ],
    "answer": "b"
  },
  {
    "type": "text",
    "text": "Apa yang dimaksud dengan pengamalan Sila Persatuan Indonesia dalam kehidupan sehari-hari?",
    "options": [
      "a. Menghormati perbedaan dan menjalin kerjasama",
      "b. Menciptakan kelompok yang terpisah",
      "c. Mengabaikan perbedaan ras dan budaya",
      "d. Mengedepankan kepentingan individu"
    ],
    "answer": "a"
  },
  {
    "type": "text",
    "text": "Dalam proses demokrasi, Sila Kerakyatan yang Dipimpin oleh Hikmat Kebijaksanaan dalam Permusyawaratan/Perwakilan berarti...",
    "options": [
      "a. Semua keputusan diambil oleh pemimpin tanpa musyawarah",
      "b. Masyarakat memiliki hak untuk memilih dan berpendapat",
      "c. Keputusan dibuat secara sepihak oleh satu orang",
      "d. Hanya kelompok tertentu yang terlibat dalam keputusan"
    ],
    "answer": "b"
  },
  {
    "type": "text",
    "text": "Sila Keadilan Sosial bagi Seluruh Rakyat Indonesia mengajarkan kita untuk...",
    "options": [
      "a. Mengabaikan kesenjangan sosial",
      "b. Memperjuangkan hak-hak sosial dan ekonomi semua rakyat",
      "c. Mengutamakan kelompok tertentu",
      "d. Menyebarluaskan kekayaan hanya di kota besar"
    ],
    "answer": "b"
  },
  {
    "type": "text",
    "text": "Contoh pengamalan Pancasila dalam masyarakat dapat berupa..",
    "options": [
      "a. Mengabaikan kebijakan pemerintah",
      "b. Menghormati dan membantu sesama tanpa membedakan",
      "c. Mengutamakan kepentingan pribadi",
      "d. Menghindari tanggung jawab sosial"
    ],
    "answer": "b"
  },
  {
    "type": "text",
    "text": "Apa yang dimaksud dengan nilai-nilai Pancasila sebagai pandangan hidup bangsa?",
    "options": [
      "a. Prinsip-prinsip yang harus diterapkan dalam sistem pendidikan",
      "b. Dasar untuk perencanaan ekonomi",
      "c. Ide dan prinsip yang membimbing perilaku dan interaksi sosial",
      "d. Pedoman untuk kebijakan luar negeri"
    ],
    "answer": "c"
  },
  {
    "type": "text",
    "text": "Dalam pelaksanaan musyawarah, prinsip dari Sila Kerakyatan yang Dipimpin oleh Hikmat Kebijaksanaan dalam Permusyawaratan / Perwakilan adalah ....",
    "options": [
      "a. Mengambil keputusan sepihak",
      "b. Mengedepankan kepentingan individu",
      "c. Berdiskusi dengan baik dan mencari solusi bersama",
      "d. Menghindari pendapat orang lain"
    ],
    "answer": "c"
  },
  {
    "type": "text",
    "text": "Apa yang harus dilakukan untuk mengamalkan Sila Kemanusiaan yang Adil dan Beradab di sekolah?",
    "options": [
      "a. Mengabaikan perasaan teman",
      "b. Membantu teman yang membutuhkan",
      "c. Mengabaikan aturan sekolah",
      "d. Menghindari interaksi social"
    ],
    "answer": "b"
  },
  {
    "type": "text",
    "text": "Puluhan siswa menggalang dana untuk korban bencana gempa bumi. Rencananya, dana sosial tersebut akan disalurkan untuk meringankan beban warga terdampak gempa bumi. Pengamalan Sila Persatuan Indonesia bisa ditunjukkan dengan ....",
    "options": [
      "a. Mengabaikan hak-hak kaum miskin atau tidak mampu",
      "b. Membantu semua orang tanpa memandang status sosial",
      "c. Mengutamakan kekayaan pribadi atau golongan",
      "d. Mengambil bantuan sosial karena merasa belum cukup"
    ],
    "answer": "b"
  },
  {
    "type": "text",
    "text": "Upacara bendera rutin dilaksanakan setiap Senin pagi. Sesuai dengan nilai-nilai Pancasila, sebagai siswa yang baik, Doni melaksanakan upacara dengan rasa ....",
    "options": [
      "a. nasionalisme atau cinta tanah air",
      "b. keimanan dan ketakwaan terhadap Tuhan Yang Maha Esa",
      "c. disiplin, tenggang rasa, dan toleransi (menghormati orang lain)",
      "d. biasa saja karena sering dilakukan di awal pekan saat masuk sekolah"
    ],
    "answer": "a"
  },
  {
    "type": "text",
    "text": "Hanan berasal dari Aceh dan beragama Islam. Indi berasal dari Sulawesi Utara dan beragama Kristen. Hanan melihat Indi terpeleset dan terjatuh. Tindakan yang harus dilakukan oleh Hanan adalah...",
    "options": [
      "a. menolong Indi secara sukarela",
      "b. menolong Indi karena dia telah berbuat baik",
      "c. tidak mau menolong Indi karena berbeda agama",
      "d. tidak mau menolong karena Indi tidak berhati-hati"
    ],
    "answer": "a"
  },
  {
    "type": "text",
    "text": "Bonar, Indi, dan teman-temannya bermusyawarah. Pendapat Bonar tidak diterima oleh teman- temannya. Sebaliknya, justru pendapat Indi yang disepakati. Sikap baik Bonar atas hasil kesepakatan itu adalah ....",
    "options": [
      "a. menolak keputusan musyawarah",
      "b. langsung meninggalkan tempat musyawarah",
      "c. menerima dan melaksanakan keputusan musyawarah",
      "d. mengalah dan tidak mau melaksanakan keputusan musyawarah"
    ],
    "answer": "c"
  },
  {
    "type": "text",
    "text": "Setiap pemilik kendaraan bermotor wajib membayar pajak setiap tahun. Membayar pajak merupakan salah satu pengamalan Pancasila, yaitu sila ...",
    "options": [
      "a. Ketuhanan Yang Maha Esa",
      "b. Kemanusiaan yang Adil dan Beradab",
      "c. Persatuan Indonesia",
      "d. Keadilan Sosial bagi Seluruh Rakyat Indonesia"
    ],
    "answer": "d"
  },
  {
    "type": "text",
    "text": "Pada pemilihan ketua kelas, kalian terpilih menjadi calon ketua kelas. Namun, pada proses selanjutnya, ternyata suara yang memilih kalian hanya sedikit. Sikap kalian terhadap hasil pemilihan adalah ... keputusan kelas.",
    "options": [
      "a. Menolak",
      "b. Mengabaikan",
      "c. Menerima",
      "d. Mengeluh"
    ],
    "answer": "c"
  }
 ]
}
