{
    "Pendidikan Pancasila": [
        {
            "type": "text",
            "text": "1. Apa yang dimaksud dengan Pancasila sebagai dasar negara?",
            "options": [
                "a. Dasar untuk merancang undang-undang",
                "b. Prinsip hidup individu atau perorangan",
                "c. Ideologi yang digunakan dalam pemerintahan",
                "d. Pandangan hidup bangsa yang harus diterapkan dalam kehidupan sehari-hari"
            ],
            "answer": "d"
        },
        {
            "type": "text",
            "text": "2. contoh pengamalan Sila Kemanusiaan yang Adil dan Beradab adalah...",
            "options": [
                "a. Mengabaikan hak orang lain",
                "b. Menghormati martabat setiap individu",
                "c. Mengutamakan kepentingan pribadi",
                "d. Hanya kelompok tertentu yang terlibat dalam keputusan"
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "3. Apa yang dimaksud dengan pengamalan Sila Persatuan Indonesia dalam kehidupan sehari-hari?",
            "options": [
                "a. Menghormati perbedaan dan menjalin kerjasama",
                "b. Menciptakan kelompok yang terpisah",
                "c. Mengabaikan perbedaan ras dan budaya",
                "d. Mengedepankan kepentingan individu"
            ],
            "answer": "a"
        },
        {
            "type": "text",
            "text": "4. Dalam proses demokrasi, Sila Kerakyatan yang Dipimpin oleh Hikmat Kebijaksanaan dalam Permusyawaratan/Perwakilan berarti...",
            "options": [
                "a. Semua keputusan diambil oleh pemimpin tanpa musyawarah",
                "b. Masyarakat memiliki hak untuk memilih dan berpendapat",
                "c. Keputusan dibuat secara sepihak oleh satu orang",
                "d. Hanya kelompok tertentu yang terlibat dalam keputusan"
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "5. Sila Keadilan Sosial bagi Seluruh Rakyat Indonesia mengajarkan kita untuk...",
            "options": [
                "a. Mengabaikan kesenjangan sosial",
                "b. Memperjuangkan hak-hak sosial dan ekonomi semua rakyat",
                "c. Mengutamakan kelompok tertentu",
                "d. Menyebarluaskan kekayaan hanya di kota besar"
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "6. Contoh pengamalan Pancasila dalam masyarakat dapat berupa..",
            "options": [
                "a. Mengabaikan kebijakan pemerintah",
                "b. Menghormati dan membantu sesama tanpa membedakan",
                "c. Mengutamakan kepentingan pribadi",
                "d. Menghindari tanggung jawab sosial"
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "7. Apa yang dimaksud dengan nilai-nilai Pancasila sebagai pandangan hidup bangsa?",
            "options": [
                "a. Prinsip-prinsip yang harus diterapkan dalam sistem pendidikan",
                "b. Dasar untuk perencanaan ekonomi",
                "c. Ide dan prinsip yang membimbing perilaku dan interaksi sosial",
                "d. Pedoman untuk kebijakan luar negeri"
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "8. Dalam pelaksanaan musyawarah, prinsip dari Sila Kerakyatan yang Dipimpin oleh Hikmat Kebijaksanaan dalam Permusyawaratan / Perwakilan adalah ....",
            "options": [
                "a. Mengambil keputusan sepihak",
                "b. Mengedepankan kepentingan individu",
                "c. Berdiskusi dengan baik dan mencari solusi bersama",
                "d. Menghindari pendapat orang lain"
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "9. Apa yang harus dilakukan untuk mengamalkan Sila Kemanusiaan yang Adil dan Beradab di sekolah?",
            "options": [
                "a. Mengabaikan perasaan teman",
                "b. Membantu teman yang membutuhkan",
                "c. Mengabaikan aturan sekolah",
                "d. Menghindari interaksi social"
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "10. Puluhan siswa menggalang dana untuk korban bencana gempa bumi. Rencananya, dana sosial tersebut akan disalurkan untuk meringankan beban warga terdampak gempa bumi. Pengamalan Sila Persatuan Indonesia bisa ditunjukkan dengan ....",
            "options": [
                "a. Mengabaikan hak-hak kaum miskin atau tidak mampu",
                "b. Membantu semua orang tanpa memandang status sosial",
                "c. Mengutamakan kekayaan pribadi atau golongan",
                "d. Mengambil bantuan sosial karena merasa belum cukup"
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "11. Upacara bendera rutin dilaksanakan setiap Senin pagi. Sesuai dengan nilai-nilai Pancasila, sebagai siswa yang baik, Doni melaksanakan upacara dengan rasa ....",
            "options": [
                "a. nasionalisme atau cinta tanah air",
                "b. keimanan dan ketakwaan terhadap Tuhan Yang Maha Esa",
                "c. disiplin, tenggang rasa, dan toleransi (menghormati orang lain)",
                "d. biasa saja karena sering dilakukan di awal pekan saat masuk sekolah"
            ],
            "answer": "a"
        },
        {
            "type": "text",
            "text": "12. Hanan berasal dari Aceh dan beragama Islam. Indi berasal dari Sulawesi Utara dan beragama Kristen. Hanan melihat Indi terpeleset dan terjatuh. Tindakan yang harus dilakukan oleh Hanan adalah...",
            "options": [
                "a. menolong Indi secara sukarela",
                "b. menolong Indi karena dia telah berbuat baik",
                "c. tidak mau menolong Indi karena berbeda agama",
                "d. tidak mau menolong karena Indi tidak berhati-hati"
            ],
            "answer": "a"
        },
        {
            "type": "text",
            "text": "13. Bonar, Indi, dan teman-temannya bermusyawarah. Pendapat Bonar tidak diterima oleh teman- temannya. Sebaliknya, justru pendapat Indi yang disepakati. Sikap baik Bonar atas hasil kesepakatan itu adalah ....",
            "options": [
                "a. menolak keputusan musyawarah",
                "b. langsung meninggalkan tempat musyawarah",
                "c. menerima dan melaksanakan keputusan musyawarah",
                "d. mengalah dan tidak mau melaksanakan keputusan musyawarah"
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "14. Setiap pemilik kendaraan bermotor wajib membayar pajak setiap tahun. Membayar pajak merupakan salah satu pengamalan Pancasila, yaitu sila ...",
            "options": [
                "a. Ketuhanan Yang Maha Esa",
                "b. Kemanusiaan yang Adil dan Beradab",
                "c. Persatuan Indonesia",
                "d. Keadilan Sosial bagi Seluruh Rakyat Indonesia"
            ],
            "answer": "d"
        },
        {
            "type": "text",
            "text": "15. Pada pemilihan ketua kelas, kalian terpilih menjadi calon ketua kelas. Namun, pada proses selanjutnya, ternyata suara yang memilih kalian hanya sedikit. Sikap kalian terhadap hasil pemilihan adalah ... keputusan kelas.",
            "options": [
                "a. Menolak",
                "b. Mengabaikan",
                "c. Menerima",
                "d. Mengeluh"
            ],
            "answer": "c"
        }
    ],
    "Bahasa Indonesia": [
        {
            "type": "text",
            "text": "1. Seorang wartawan bertanya kepada seorang musisi, \"Apa yang membuat Anda merasa bersemangat dalam karier Anda?\" Pertanyaan ini cukup baik untuk wawancara karena...",
            "options": [
                "a. Fokus pada materi dan tidak menyudutkan narasumber.",
                "b. Menggunakan bahasa yang sangat santun dan formal.",
                "c. Pasti akan menghasilkan jawaban yang kontroversial.",
                "d. Merupakan pertanyaan yang singkat dan mudah dijawab."
            ],
            "answer": "a"
        },
        {
            "type": "text",
            "text": "2. Perhatikan kalimat: \"Pentas itu sangat megah sekali.\" Kalimat tersebut tidak efektif karena...",
            "options": [
                "a. Tidak memiliki subjek yang jelas.",
                "b. Menggunakan kata 'pentas' yang bukan kata baku.",
                "c. Terjadi pengulangan kata yang tidak perlu.",
                "d. Memiliki makna ganda."
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "3. Kalimat \"Obat itu harus dibeli di apotik\" salah secara kebahasaan karena...",
            "options": [
                "a. Kata 'obat' seharusnya diganti 'medikasi'.",
                "b. Kalimat tersebut tidak memiliki predikat.",
                "c. Kata 'apotik' bukan merupakan kata baku.",
                "d. Kalimat tersebut terlalu pendek sehingga tidak efektif."
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "4. Untuk memahami alasan seorang musisi Indonesia memilih berkarya di luar negeri, kata tanya yang paling tepat digunakan untuk membuat peta pikiran adalah...",
            "options": [
                "a. Apa",
                "b. Di mana",
                "c. Kapan",
                "d. Mengapa"
            ],
            "answer": "d"
        },
        {
            "type": "text",
            "text": "5. Kalimat \"Angin malam membelai rambutnya yang tergerai\" menggunakan majas personifikasi karena...",
            "options": [
                "a. Membandingkan angin dengan belaian secara langsung.",
                "b. Memberikan sifat manusia (membelai) pada benda mati (angin).",
                "c. Melebih-lebihkan kekuatan angin malam.",
                "d. Membuat kalimat menjadi lebih indah didengar."
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "6. Perbedaan utama antara teks biografi (narasi sejarah) dengan legenda adalah...",
            "options": [
                "a. Biografi menceritakan pahlawan, sedangkan legenda menceritakan dewa.",
                "b. Biografi didasarkan pada fakta, sedangkan legenda berisi mitos atau cerita rakyat.",
                "c. Biografi selalu panjang, sedangkan legenda selalu pendek.",
                "d. Biografi menggunakan bahasa baku, sedangkan legenda menggunakan bahasa gaul."
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "7. Kalimat \"Suaranya menggelegar membelah angkasa saat menyanyikan lagu itu\" menggunakan majas hiperbola karena...",
            "options": [
                "a. Suara tersebut benar-benar bisa membelah angkasa.",
                "b. Membandingkan suara dengan petir yang menggelegar.",
                "c. Memberikan kesan yang sangat kuat (dramatis) dengan melebih-lebihkan.",
                "d. Memberikan sifat 'membelah' pada 'suara'."
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "8. Kalimat \"Anak itu adalah seorang kutu buku di kelasnya\" menggunakan majas metafora karena...",
            "options": [
                "a. Anak tersebut benar-benar terlihat seperti kutu.",
                "b. Membandingkan anak tersebut dengan 'kutu buku' (orang yang suka membaca) secara langsung.",
                "c. Melebih-lebihkan kegemaran membaca anak tersebut.",
                "d. Memberikan sifat 'buku' kepada 'anak'."
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "9. Penggunaan kata baku sangat penting dalam penulisan laporan hasil wawancara. Tujuannya adalah...",
            "options": [
                "a. Agar laporan terlihat lebih panjang dan rumit.",
                "b. Agar narasumber merasa lebih dihargai oleh pewawancara.",
                "c. Agar laporan mudah dipahami oleh semua pembaca sesuai kaidah bahasa.",
                "d. Agar pewawancara terlihat lebih pintar daripada narasumber."
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "10. Dalam sebuah teks biografi, penulis menceritakan bahwa sang tokoh \"harus bekerja keras membanting tulang sejak pagi buta\". Ungkapan \"membanting tulang\" dalam kalimat tersebut...",
            "options": [
                "a. Harus dipahami secara harfiah bahwa tokoh itu membanting tulangnya.",
                "b. Merupakan majas metafora yang membandingkan kerja dengan tulang.",
                "c. Membuat kalimat tersebut menjadi tidak efektif karena ambigu.",
                "d. Merupakan kiasan yang digunakan untuk melebih-lebihkan kerja keras tokoh."
            ],
            "answer": "d"
        },
        {
            "type": "text",
            "text": "11. Jika kamu ingin membuat laporan hasil wawancara tentang \"perjalanan karier seorang musisi\", bagian isi laporan yang paling penting harus mencakup...",
            "options": [
                "a. Daftar lengkap semua lagu yang pernah diciptakan musisi tersebut.",
                "b. Ringkasan jawaban narasumber tentang proses dan tantangan kariernya.",
                "c. Opini pribadi pewawancara tentang musik narasumber.",
                "d. Foto-foto studio musik milik narasumber."
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "12. Manakah di antara penggunaan kata baku berikut yang tepat?",
            "options": [
                "a. Para atlit sedang berlatih di stadion.",
                "b. Dia memiliki hobi berpetualang dan aktivitas luar ruangan.",
                "c. Ibu membeli obat di apotik terdekat.",
                "d. Jadual pelajaran hari ini sangat padat."
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "13. Saat menyusun daftar pertanyaan wawancara, seorang siswa menulis: \"Kapan Anda lahir dan di mana Anda sekolah?\" Pertanyaan ini kurang ideal untuk wawancara mendalam karena...",
            "options": [
                "a. Terlalu fokus pada materi dan tidak santun.",
                "b. Menggabungkan dua pertanyaan berbeda dalam satu kalimat.",
                "c. Merupakan pertanyaan yang akan menyudutkan narasumber.",
                "d. Menggunakan bahasa yang tidak baku (kata 'sekolah')."
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "14. Manakah perbaikan yang paling tepat untuk kalimat tidak efektif \"Dia sangat pintar sekali sehingga dapat nilai bagus\"?",
            "options": [
                "a. Dia sangat pintar sehingga dapat nilai bagus.",
                "b. Dia sangat teramat pintar sehingga dapat nilai bagus.",
                "c. Pintar sekali dia sehingga dapat nilai bagus.",
                "d. Dia pintar sehingga dapat nilai bagus."
            ],
            "answer": "a"
        },
        {
            "type": "text",
            "text": "15. Seorang siswa membaca teks tentang musisi dunia. Ia ingin membandingkan cara musisi A dan musisi B dalam menciptakan lagu. Kata tanya yang dominan pada peta pikirannya adalah...",
            "options": [
                "a. Apa",
                "b. Siapa",
                "c. Bagaimana",
                "d. Kapan"
            ],
            "answer": "c"
        }
    ],
    "Matematika": [
        {
            "text": "1. Hasil dari 1 1/2 × 2 1/3 × 3 adalah...",
            "options": [
                "a. 10 1/2",
                "b. 8 1/4",
                "c. 11 1/4",
                "d. 9 1/2"
            ],
            "answer": "a"
        },
        {
            "text": "2. Hasil dari 6 : 1 1/2 : 2 adalah...",
            "options": [
                "a. 3",
                "b. 2",
                "c. 1",
                "d. 4"
            ],
            "answer": "b"
        },
        {
            "text": "3. Urutkan pecahan berikut dari yang terkecil: 0,5 ; 4 1/4 ; 30% ; 1 1/5 ; 0,2",
            "options": [
                "a. 0,2 ; 30% ; 0,5 ; 1 1/5 ; 4 1/4",
                "b. 0,2 ; 0,5 ; 30% ; 1 1/5 ; 4 1/4",
                "c. 30% ; 0,2 ; 0,5 ; 1 1/5 ; 4 1/4",
                "d. 0,2 ; 30% ; 4 1/4 ; 0,5 ; 1 1/5"
            ],
            "answer": "a"
        },
        {
            "text": "4. Ibu membeli 4 3/4 kg gula dan menggunakan 0,5 bagian untuk membuat kue. Berapa kg gula yang digunakan Ibu?",
            "options": [
                "a. 4 1/4 kg",
                "b. 2 3/8 kg",
                "c. 8 3/4 kg",
                "d. 1,25 kg"
            ],
            "answer": "b"
        },
        {
            "text": "5. Kakak memiliki pita 3,5 meter dan dipotong masing-masing 1 3/4 meter. Berapa potongan yang didapat?",
            "options": [
                "a. 4 potong",
                "b. 3 potong",
                "c. 2 potong",
                "d. 1 potong"
            ],
            "answer": "c"
        },
        {
            "text": "6. Urutan suhu dari yang terpanas jika: Kota A = 25 1/2°C, Kota B = 25,8°C, Kota C = 25 3/5°C, Kota D = 25,2°C",
            "options": [
                "a. Kota B, Kota C, Kota A, Kota D",
                "b. Kota D, Kota A, Kota C, Kota B",
                "c. Kota B, Kota A, Kota C, Kota D",
                "d. Kota D, Kota C, Kota A, Kota B"
            ],
            "answer": "a"
        },
        {
            "text": "7. Memet memiliki 11 kelereng merah dan 8 kelereng biru. Tentukan Perbandingan kelereng biru terhadap kelereng merah?",
            "options": [
                "a. 11 : 8",
                "b. 8 : 11",
                "c. 8 : 18",
                "d. 11 : 18"
            ],
            "answer": "b"
        },
        {
            "text": "8. Umur Ayah 40 tahun dan Ibu 35 tahun. Perbandingan umur Ayah dan Ibu dalam bentuk paling sederhana adalah...",
            "options": [
                "a. 40 : 35",
                "b. 7 : 8",
                "c. 8 : 7",
                "d. 4 : 3"
            ],
            "answer": "c"
        },
        {
            "text": "9. Perbandingan kelereng Ali dan Budi adalah 2 : 3. Jika jumlahnya 25 butir, berapa kelereng Ali?",
            "options": [
                "a. 15 butir",
                "b. 10 butir",
                "c. 5 butir",
                "d. 20 butir"
            ],
            "answer": "b"
        },
        {
            "text": "10. Perbandingan uang Ani dan Ina adalah 3 : 5. Jika uang Ani Rp15.000, berapa uang Ina?",
            "options": [
                "a. Rp15.000",
                "b. Rp5.000",
                "c. Rp40.000",
                "d. Rp25.000"
            ],
            "answer": "d"
        },
        {
            "type": "text",
            "text": "11. Perbandingan umur Ayah dan Kakak adalah 7 : 2. Jika umur Ayah sekarang adalah 35 tahun, berapakah umur Kakak?",
            "options": [
                "a. 5 tahun",
                "b. 10 tahun",
                "c. 14 tahun",
                "d. 20 tahun"
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "12. Perbandingan jumlah kambing dan sapi di peternakan Pak Jaya adalah 8 : 3. Jika jumlah sapi ada 15 ekor, berapakah jumlah kambing di peternakan itu?",
            "options": [
                "a. 15 ekor",
                "b. 24 ekor",
                "c. 40 ekor",
                "d. 55 ekor"
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "13. Perbandingan jumlah buku cerita dan buku pelajaran di rak adalah 2 : 7. Jumlah kedua jenis buku tersebut adalah 54 buah. Berapa banyak buku pelajaran yang ada di rak?",
            "options": [
                "a. 12 buah",
                "b. 6 buah",
                "c. 54 buah",
                "d. 42 buah"
            ],
            "answer": "d"
        }
    ],
    "IPAS": [
        {
            "type": "text",
            "text": "1. Kedatangan bangsa Eropa ke Indonesia dipicu oleh keinginan untuk mencari rempah-rempah. Mengapa rempah-rempah dianggap sangat berharga saat itu?",
            "options": [
                "a. Karena bisa dijadikan perhiasan",
                "b. Karena digunakan untuk membuat makanan awet dan obat",
                "c. Karena menjadi bahan bangunan",
                "d. Karena hanya tumbuh di Eropa"
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "2. Perlawanan terhadap Portugis terjadi di banyak tempat, seperti Ternate, Demak, dan Aceh. Mengapa perlawanan-perlawanan ini pada akhirnya gagal mengusir Portugis dari Nusantara saat itu?",
            "options": [
                "a. Karena perlawanan masih bersifat kedaerahan (regional) dan belum ada persatuan nasional antar kerajaan.",
                "b. Karena tentara Portugis jumlahnya jutaan sehingga tidak terkalahkan.",
                "c. Karena semua raja di Indonesia adalah teman baik Portugis.",
                "d. Karena Portugis memiliki senjata yang jauh lebih modern, seperti tank dan pesawat tempur."
            ],
            "answer": "a"
        },
        {
            "type": "text",
            "text": "3. Setelah VOC bangkrut, pemerintah Belanda menerapkan Tanam Paksa (Cultuurstelsel). Apa dampak dari kebijakan ini bagi petani Indonesia?",
            "options": [
                "a. Petani menjadi sangat kaya raya karena hasil panennya dibeli mahal oleh Belanda.",
                "b. Petani punya banyak waktu luang karena pekerjaannya sangat mudah.",
                "c. Petani tidak bisa menanam padi untuk makan, sehingga terjadi kelaparan dan kemiskinan yang parah.",
                "d. Petani menjadi lebih sehat karena bisa makan kopi, tebu, dan nila setiap hari."
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "4. Penyebab utama terjadinya Perang Jawa adalah …",
            "options": [
                "a. Perselisihan keluarga kerajaan",
                "b. Penarikan pajak yang tinggi dan perampasan tanah leluhur",
                "c. Perebutan tahta kerajaan",
                "d. Perbedaan agama"
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "5. Perang Padri di Sumatera Barat awalnya adalah perang saudara antara Kaum Padri dan Kaum Adat. Bagaimana Belanda akhirnya bisa terlibat dan memenangkan perang ini?",
            "options": [
                "a. Belanda diminta menjadi penengah yang jujur oleh kedua belah pihak.",
                "b. Belanda bersatu dengan Kaum Padri dan Kaum Adat untuk melawan penjajah lain.",
                "c. Belanda tidak ikut campur sama sekali dalam Perang Padri.",
                "d. Belanda memanfaatkan perpecahan itu; mereka membantu Kaum Adat yang terdesak, lalu setelah Kaum Padri kalah, Belanda berbalik menguasai Kaum Adat."
            ],
            "answer": "d"
        },
        {
            "type": "text",
            "text": "6. Lahirnya organisasi pergerakan nasional seperti Budi Utomo (1908) dan Sarekat Islam (1911) dipelopori oleh kaum terpelajar. Dari manakah kaum terpelajar ini muncul?",
            "options": [
                "a. Mereka adalah lulusan sekolah-sekolah yang didirikan Belanda sebagai bagian dari Politik Etis.",
                "b. Mereka adalah para bangsawan yang belajar di luar negeri atas biaya sendiri.",
                "c. Mereka adalah keturunan langsung tentara Belanda yang membelot.",
                "d. Mereka adalah pedagang kaya raya yang belajar dari pedagang asing."
            ],
            "answer": "a"
        },
        {
            "type": "text",
            "text": "7. Sumpah Pemuda (1928) mengikrarkan 'Satu Nusa, Satu Bangsa, dan Satu Bahasa'. Mengapa kesepakatan untuk 'Satu Bahasa: Indonesia' menjadi sangat penting bagi perjuangan kemerdekaan?",
            "options": [
                "a. Agar orang Indonesia bisa melupakan bahasa daerahnya masing-masing.",
                "b. Untuk menyatukan ratusan suku bangsa yang berbeda bahasa agar bisa berkomunikasi dan berjuang bersama sebagai satu 'Bangsa Indonesia'.",
                "c. Karena Bahasa Indonesia adalah bahasa yang paling sulit dipelajari di dunia.",
                "d. Agar Belanda bingung karena tidak mengerti apa yang dibicarakan para pemuda."
            ],
            "answer": "b"
        },
        {
            "type": "text",
            "text": "8. Bagaimana peristiwa bom atom di Hiroshima dan Nagasaki bisa mempercepat proklamasi kemerdekaan Indonesia?",
            "options": [
                "a. Bom itu membuat Jepang semakin kuat dan semakin ketat menjaga Indonesia.",
                "b. Bom itu adalah hadiah dari Amerika agar Indonesia bisa merdeka.",
                "c. Para pemimpin Indonesia takut akan dibom juga, sehingga segera memproklamasikan kemerdekaan.",
                "d. Bom itu membuat Jepang menyerah tanpa syarat, sehingga terjadi 'kekosongan kekuasaan' yang dimanfaatkan Indonesia."
            ],
            "answer": "d"
        },
        {
            "type": "text",
            "text": "9. Pangeran Antasari adalah pahlawan dari Kalimantan Selatan yang memimpin Perang Banjar. Apa motivasi utama Pangeran Antasari dan rakyat Banjar melawan Belanda?",
            "options": [
                "a. Belanda ingin membeli semua intan di Martapura dengan harga sangat mahal.",
                "b. Belanda ingin membangun ibu kota baru di Banjarmasin.",
                "c. Belanda ikut campur dalam urusan internal istana (pengangkatan raja) dan memonopoli perdagangan hasil bumi (batu bara, lada).",
                "d. Rakyat Banjar tidak suka dengan cara Belanda membangun jalan raya."
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "10. Setelah Jepang menyerah (14 Agustus 1945) Peristiwa penting apa yang pertama kali terjadi setelah kabar ini didengar oleh pemuda Indonesia?",
            "options": [
                "a. Peristiwa Rengasdengklok.",
                "b. Pembacaan teks Proklamasi.",
                "c. Para pemuda (seperti Sutan Syahrir) mendesak Golongan Tua (Sukarno-Hatta) untuk segera memproklamasikan kemerdekaan.",
                "d. Pembentukan BPUPKI oleh Jepang."
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "11. Apa tujuan sebenarnya Golongan Muda membawa Sukarno dan Hatta ke Rengasdengklok pada 16 Agustus 1945?",
            "options": [
                "a. Untuk menjauhkan Sukarno-Hatta dari pengaruh Jepang di Jakarta dan meyakinkan mereka agar segera memproklamasikan kemerdekaan.",
                "b. Untuk menculik dan menggantikan Sukarno dan Hatta dengan pemimpin baru.",
                "c. Untuk mengajak Sukarno dan Hatta berlibur di pedesaan yang sejuk.",
                "d. Untuk menghukum Sukarno dan Hatta karena dianggap terlalu lambat."
            ],
            "answer": "a"
        },
        {
            "type": "text",
            "text": "12. Bagaimana cara terbaik bagi seorang siswa SD untuk 'mempertahankan kemerdekaan' pada masa sekarang?",
            "options": [
                "a. Ikut berperang melawan negara lain yang mencoba menjajah Indonesia.",
                "b. Tidak perlu melakukan apa-apa, karena kemerdekaan sudah dijaga oleh TNI.",
                "c. Membeli semua produk buatan luar negeri agar Indonesia dikenal dunia.",
                "d. Belajar dengan rajin, menghargai perbedaan (toleransi), dan mencintai budaya serta produk dalam negeri."
            ],
            "answer": "d"
        },
        {
            "type": "text",
            "text": "13. Mengapa 'persatuan dan kesatuan' (seperti dalam Sumpah Pemuda) masih sangat penting untuk mempertahankan kemerdekaan Indonesia di masa sekarang?",
            "options": [
                "a. Agar Indonesia bisa menjajah negara lain seperti Belanda dulu.",
                "b. Supaya Indonesia bisa memenangkan semua pertandingan olahraga internasional.",
                "c. Karena ancaman terbesar saat ini bisa berupa perpecahan dari dalam (adu domba, hoaks, konflik SARA) yang melemahkan bangsa.",
                "d. Agar semua orang di Indonesia memiliki agama dan suku yang sama."
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "14. Sukarno dan Hatta dikenal sebagai 'tokoh Proklamator'. Mengapa Hatta juga sangat penting dan disebut Proklamator, padahal Sukarno yang membacakan teks proklamasi?",
            "options": [
                "a. Karena Hatta yang memegang tiang bendera saat upacara.",
                "b. Karena Hatta yang mengetik naskah proklamasi.",
                "c. Karena Hatta ikut merumuskan dan menandatangani teks proklamasi 'Atas nama bangsa Indonesia' bersama Sukarno, sebagai simbol persatuan kepemimpinan.",
                "d. Karena Hatta adalah wakil dari Golongan Muda yang mendesak proklamasi."
            ],
            "answer": "c"
        },
        {
            "type": "text",
            "text": "15. Achmad Soebardjo adalah salah satu tokoh penting pada masa kemerdekaan. Apa perannya dalam Peristiwa Rengasdengklok?",
            "options": [
                "a. Dia yang menculik Sukarno dan Hatta ke Rengasdengklok.",
                "b. Dia yang menjadi penengah (mediator) antara Golongan Muda dan Golongan Tua, serta menjamin proklamasi akan dilaksanakan esok harinya.",
                "c. Dia yang mengetik teks proklamasi di rumahnya.",
                "d. Dia yang mengibarkan bendera Merah Putih saat proklamasi."
            ],
            "answer": "b"
        }
    ],
    "Seni Rupa": [
    {
        "type": "text",
        "text": "1. Teknik menggambar yang menggunakan goresan garis-garis (lurus, lengkung, atau silang) untuk menunjukkan gelap-terang adalah teknik...",
        "options": [
            "a. Dussel",
            "b. Blok",
            "c. Arsir",
            "d. Pointilis"
        ],
        "answer": "c"
    },
    {
        "type": "text",
        "text": "2. Alat yang paling umum digunakan untuk membuat gambar dengan teknik arsir adalah...",
        "options": [
            "a. Kuas dan cat air",
            "b. Jari tangan",
            "c. Kapas",
            "d. Pensil atau pulpen"
        ],
        "answer": "d"
    },
    {
        "type": "text",
        "text": "3. Teknik menggambar dengan cara menggosok-gosokkan pensil sehingga gambar terlihat lebih halus disebut teknik...",
        "options": [
            "a. Dussel",
            "b. Pointilis",
            "c. Blok",
            "d. Arsir"
        ],
        "answer": "a"
    },
    {
        "type": "text",
        "text": "4. Apa tujuan utama dari teknik dussel?",
        "options": [
            "a. Membuat gambar terlihat seperti kotak-kotak",
            "b. Membuat gambar terlihat penuh titik",
            "c. Membuat perpindahan (gradasi) warna dari gelap ke terang terlihat halus",
            "d. Membuat gambar terlihat seperti bayangan hitam saja"
        ],
        "answer": "c"
    },
    {
        "type": "text",
        "text": "5. Selain pensil, alat bantu yang sering digunakan untuk pada teknik dussel adalah...",
        "options": [
            "a. Penggaris",
            "b. Gunting",
            "c. Kapas, tisu, atau jari tangan",
            "d. Pulpen berwarna"
        ],
        "answer": "c"
    },
    {
        "type": "text",
        "text": "6. Teknik menggambar yang menutup seluruh bentuk objek dengan satu warna saja (biasanya warna hitam) disebut teknik...",
        "options": [
            "a. Arsir",
            "b. Pointilis",
            "c. Dussel",
            "d. Blok"
        ],
        "answer": "d"
    },
    {
        "type": "text",
        "text": "7. Nama lain untuk teknik blok adalah...",
        "options": [
            "a. Teknik Siluet",
            "b. Teknik Gradasi",
            "c. Teknik Sketsa",
            "d. Teknik Abstrak"
        ],
        "answer": "a"
    },
    {
        "type": "text",
        "text": "8. Teknik menggambar yang mengutamakan penggunaan garis sebagai pembentuk gambar disebut...",
        "options": [
            "a. Linear",
            "b. Teknik Dussel",
            "c. Teknik Blok",
            "d. Teknik Pointilis"
        ],
        "answer": "a"
    },
    {
        "type": "text",
        "text": "9. Dalam teknik garis, gelap-terang atau tekstur benda biasanya ditunjukkan melalui...",
        "options": [
            "a. Gosokan kapas",
            "b. Kerapatan atau ketebalan garis",
            "c. Pemberian warna cat air",
            "d. Titik-titik yang banyak"
        ],
        "answer": "b"
    },
    {
        "type": "text",
        "text": "10. Alat gambar yang paling cocok untuk teknik garis agar hasilnya tegas dan jelas adalah...",
        "options": [
            "a. Kapas",
            "b. Jari tangan",
            "c. Pen gambar atau spidol kecil",
            "d. Cat minyak"
        ],
        "answer": "c"
    },
    {
        "type": "text",
        "text": "11. Bagaimana cara membuat bagian yang gelap pada gambar yang menggunakan teknik pointilis?",
        "options": [
            "a. Menggunakan garis yang tebal",
            "b. Menggosoknya dengan kapas",
            "c. Membuat titik-titik yang lebih besar dan lebih rapat",
            "d. Mewarnainya dengan cat air"
        ],
        "answer": "c"
    },
    {
        "type": "text",
        "text": "12. Untuk membuat bagian yang terang pada teknik pointilis, maka titik-titiknya harus dibuat...",
        "options": [
            "a. Semakin rapat dan besar",
            "b. Semakin jarang dan kecil",
            "c. Disilang-silang",
            "d. Digosok-gosok"
        ],
        "answer": "b"
    },
    {
        "type": "text",
        "text": "13. Teknik pointilis membutuhkan ... yang tinggi karena harus membuat banyak titik.",
        "options": [
            "a. Kecepatan",
            "b. Kesabaran dan ketelitian",
            "c. Cat yang banyak",
            "d. Kertas yang besar"
        ],
        "answer": "b"
    },
    {
        "type": "text",
        "text": "14. Ciri utama dari goresan pada sketsa adalah...",
        "options": [
            "a. Tebal, hitam, dan tidak bisa dihapus",
            "b. Tipis, ringan, dan mudah dihapus jika salah",
            "c. Berwarna-warni seperti pelangi",
            "d. Selalu berbentuk titik-titik"
        ],
        "answer": "b"
    },
    {
        "type": "text",
        "text": "15. Kapan seorang seniman biasanya membuat sketsa?",
        "options": [
            "a. Di tahap paling akhir setelah gambar jadi",
            "b. Di tahap paling awal sebelum menggambar detail",
            "c. Hanya jika disuruh guru",
            "d. Setelah gambar diwarnai"
        ],
        "answer": "b"
    }
  ]
}
